# Demonstration of basic Pandas methods

In [1]:
import pandas as pd
import numpy as np

## Series

**Series** are a special type of data structure available in the pandas Python library. Pandas Series are similar to NumPy arrays, except that we can give them **a named or datetime index instead of just a numerical index.**

In [2]:
labels = ['a', 'b', 'c']

my_list = [10, 20, 30]

arr = np.array([10, 20, 30])

d = {'a':10, 'b':20, 'c':30}

In [3]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

- We can add labels to a pandas Series using the index argument

In [4]:
series = pd.Series(my_list, index=labels)
print(series)

a    10
b    20
c    30
dtype: int64

In [5]:
series['a']

10

In [6]:
series[0]

10

- The ability to reference an element of a Series using its label is similar to how we can reference the value of a key-value pair in a dictionary

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

**The Main Advantage of Pandas Series Over NumPy Arrays**: every element of a NumPy array must be the same type of data structure. Pandas Series do not suffer from this limitation.

## DataFrames

**DataFrame** is a set of pandas Series that shares the same index

NumPy allows developers to work with both **one-dimensional NumPy arrays (sometimes called vectors)** and **two-dimensional NumPy arrays (sometimes called matrices).** 
- Series are similar to one-dimensional NumPy arrays.
- Pandas DataFrames are similar to two-dimensional NumPy arrays - but with much more functionality.

In [8]:
rows = ['X','Y','Z']

cols = ['A', 'B', 'C', 'D', 'E']

data = np.round(np.random.randn(3,5),2)

In [9]:
df = pd.DataFrame(data, rows, cols)
df

      A     B     C     D     E
X  0.17 -0.23 -0.44 -0.00 -0.73
Y -1.13 -0.74 -0.08  0.38  2.13
Z  2.21  0.21  0.76 -0.27  0.15

In [10]:
df['A']['X']

0.17

## Main information

By default, Pandas shows only 20 columns and 60 rows. To see more, use the function **set_option**:
- pd.set_option('display.max_columns', 100)
- pd.set_option('display.max_rows', 100)

In [11]:
df.shape

(3, 5)

In [13]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [14]:
df.index

Index(['X', 'Y', 'Z'], dtype='object')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, X to Z
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
 2   C       3 non-null      float64
 3   D       3 non-null      float64
 4   E       3 non-null      float64
dtypes: float64(5)
memory usage: 224.0+ bytes

In [33]:
df.describe()

              A         B         C         D         E
count  3.000000  3.000000  3.000000  3.000000  3.000000
mean   0.333333 -0.253333  0.080000  0.036667  0.516667
std    1.527525  0.475430  0.615792  0.326548  1.464832
min   -1.000000 -0.740000 -0.440000 -0.270000 -0.730000
25%   -0.500000 -0.485000 -0.260000 -0.135000 -0.290000
50%    0.000000 -0.230000 -0.080000  0.000000  0.150000
75%    1.000000 -0.010000  0.340000  0.190000  1.140000
max    2.000000  0.210000  0.760000  0.380000  2.130000

In [34]:
''' To view statistics on non-numeric features, you need to explicitly specify the types of 
interest to us in the include parameter'''

df.describe(include=['object', 'bool'])

       index
count      3
unique     3
top        Z
freq       1

## Indexing data

### loc / iloc

DataFrame rows and columns can be accessed by their label using the **loc** attribute along with square brackets or by their numerical index using the **iloc** attribute along with square brackets.
- when we pass a slice object to iloc, the dataframe is sliced as usual 
- in the case of loc, both the beginning and the end of the slice are taken into account.

In [16]:
df.loc['X':'Z', 'A':'C']

      A     B     C
X  0.17 -0.23 -0.44
Y -1.13 -0.74 -0.08
Z  2.21  0.21  0.76

In [17]:
df.iloc[0:2, 0:2]

      A     B
X  0.17 -0.23
Y -1.13 -0.74

For getting a scalar value
- df.loc[index[value_of index], "column_name"]

For getting fast access to a scalar (equivalent to the prior method):
- df.at[index[value_of index], "column_name"]

### Conditional Selection

For example, if we wanted to know where our DataFrame has values that were greater than 0

In [18]:
df > 0

       A      B      C      D      E
X   True  False  False  False  False
Y  False  False  False   True   True
Z   True   True   True  False   True

We can also generate a new pandas DataFrame that contains the normal values where the statement is True, and NaN values where the statement is false.

In [19]:
df[df > 0]

      A     B     C     D     E
X  0.17   NaN   NaN   NaN   NaN
Y   NaN   NaN   NaN  0.38  2.13
Z  2.21  0.21  0.76   NaN  0.15

In [20]:
df['D'] > 1

X    False
Y    False
Z    False
Name: D, dtype: bool

In [22]:
df[df['D'] > 0]

      A     B     C     D     E
Y -1.13 -0.74 -0.08  0.38  2.13

### How To Modify The Index of DF

There are a number of ways that you can modify the index of a pandas DataFrame.

- The most basic is to reset the index to its default numerical values using the **reset_index method**. This creates a new column in the DF called index that contains the previous index labels:

In [23]:
df.reset_index(inplace=True)
df

  index     A     B     C     D     E
0     X  0.17 -0.23 -0.44 -0.00 -0.73
1     Y -1.13 -0.74 -0.08  0.38  2.13
2     Z  2.21  0.21  0.76 -0.27  0.15

In [25]:
df.index

RangeIndex(start=0, stop=3, step=1)

You can also set **an existing column as the index** of the DataFrame using the **set_index** method.

In [26]:
df.set_index('A')

      index     B     C     D     E
A
 0.17     X -0.23 -0.44 -0.00 -0.73
-1.13     Y -0.74 -0.08  0.38  2.13
 2.21     Z  0.21  0.76 -0.27  0.15

**There are three things worth noting here:**

- set_index does not modify the original DataFrame unless you either (1) force it to using the = assignment operator or (2) specify inplace=True.

- unless you run reset_index first, performing a set_index operation with inplace=True or a forced = assignment operator will permanently overwrite your current index values.

- if you want to rename your index to labels that are not currently contained in a column, you can do so by (1) creating a NumPy array with those values, (2) adding those values as a new row of the pandas DataFrame, and (3) running the set_index operation.

## Missing Data

In [36]:
df = pd.DataFrame(np.array([[1, 5, 1],[2, np.nan, 2],[np.nan, np.nan, 3]]))

df.columns = ['A', 'B', 'C']

df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

### dropna()

When applied against a DataFrame, **the dropna method will remove any rows that contain a NaN value**.

In [37]:
df.dropna()

     A    B    C
0  1.0  5.0  1.0

We can also **drop any columns that have missing values by passing in the axis=1 argument to the dropna method**

In [38]:
df.dropna(axis=1)

     C
0  1.0
1  2.0
2  3.0

### fillna()

In many cases, you will want **to replace missing values in a DF instead of dropping it completely**.

In [39]:
df.fillna('*')

   A  B    C
0  1  5  1.0
1  2  *  2.0
2  *  *  3.0

## Join DF

### concat()

By default, pandas will **concatenate along axis=0**, which means that its adding rows, not columns.


**If you want to add columns, simply pass in axis=1** as a new variable into the concat function.

In [40]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],

                        'B': ['B0', 'B1', 'B2', 'B3'],

                        'C': ['C0', 'C1', 'C2', 'C3'],

                        'D': ['D0', 'D1', 'D2', 'D3']},

                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],

                        'B': ['B4', 'B5', 'B6', 'B7'],

                        'C': ['C4', 'C5', 'C6', 'C7'],

                        'D': ['D4', 'D5', 'D6', 'D7']},

                         index=[4, 5, 6, 7])

In [41]:
pd.concat([df1, df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [42]:
pd.concat([df1, df2], axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

### merge()

You can merge two DF along a common column using the merge columns.

In [43]:
leftDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                     'A': ['A0', 'A1', 'A2', 'A3'],

                     'B': ['B0', 'B1', 'B2', 'B3']})

   

rightDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                          'C': ['C0', 'C1', 'C2', 'C3'],

                          'D': ['D0', 'D1', 'D2', 'D3']})

In [44]:
pd.merge(leftDataFrame, rightDataFrame, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### join()

Joining pandas DataFrames is very similar to merging pandas DataFrames except that **the keys on which youd like to combine are in the index instead of contained within a column.**

In [45]:
leftDataFrame = pd.DataFrame({  'A': ['A0', 'A1', 'A2', 'A3'],

                                'B': ['B0', 'B1', 'B2', 'B3']},

                                index =['K0', 'K1', 'K2', 'K3'])

   

rightDataFrame = pd.DataFrame({ 'C': ['C0', 'C1', 'C2', 'C3'],

                                'D': ['D0', 'D1', 'D2', 'D3']},

                                index = ['K0', 'K1', 'K2', 'K3'])

In [46]:
leftDataFrame.join(rightDataFrame)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

## Changing DF

**Note that map() and apply() return new, transformed Series and DataFrames, respectively. They don't modify the original data they're called on.**

### map()

**applying a function to each cell in a column**


The function you pass to map() should expect a single value from the Series, and return a transformed version of that value. map() returns a new Series where all the values have been transformed by your function.

In [47]:
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

In [49]:
def more_than_0(x):
    if x > 0:
        return x
    else:
        return 0
    
df['A'].map(more_than_0)

0    1.0
1    2.0
2    0.0
Name: A, dtype: float64

### apply()

**applying a function to each column**

apply() is the equivalent to map() method if we want to transform a whole DataFrame by calling a custom method on each row. 

If we had called df.apply() with axis='index', then instead of passing a function to transform each row, we would need to give a function to transform each column.

In [50]:
# In the example below we want to replace points to stars
df = pd.read_csv('https://drive.google.com/uc?export=download&id=1eWhoOYOqiPuAKxsdiUL4c_uppcdvb0hY', index_col=0)

In [51]:
df.head(3)

,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulk Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin OKeefe,@kerinokeefe,Nicosia 2013 Vulk Bianco (Etna),White Blend,Nicosia
1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm

In [52]:
def stars(row):
    #star = 0
    if row.points >= 95 or row.country == 'Canada':
        return 3
    elif 85 <= row.points < 95:
        return 2
    else:
        return 1

In [53]:
df['stars'] = df.apply(stars, axis='columns')
df.head()

,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery,stars
0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulk Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin OKeefe,@kerinokeefe,Nicosia 2013 Vulk Bianco (Etna),White Blend,Nicosia,2
1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos,2
2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm,2
3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian,2
4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks,2

### groupby()

What is the best wine I can buy for a given amount of money? Create a Series whose index is wine prices and whose values is the maximum number of points a wine costing that much was given in a review. Sort the values by price, ascending

In [54]:
best_rating_per_price = df.groupby('price').points.max().sort_index()
best_rating_per_price.head(10)

price
4.0     86
5.0     87
6.0     88
7.0     91
8.0     91
9.0     91
10.0    91
11.0    92
12.0    93
13.0    94
Name: points, dtype: int64

What are the minimum and maximum prices for each variety of wine? Create a DataFrame whose index is the variety category from the dataset and whose values are the min and max values thereof.

In [55]:
price_extremes = df.groupby('variety').price.agg(['min', 'max'])
price_extremes.head()

              min    max
variety
Abouriou     15.0   75.0
Agiorgitiko  10.0   66.0
Aglianico     6.0  180.0
Aidani       27.0   27.0
Airen         8.0   10.0

In [57]:
# grouping by several columns
country_variety_counts = df.groupby(['country', 'variety']).points.count().sort_values(ascending=False)
country_variety_counts.head()

country  variety
US       Pinot Noir                  9885
         Cabernet Sauvignon          7315
         Chardonnay                  6801
France   Bordeaux-style Red Blend    4725
Italy    Red Blend                   3624
Name: points, dtype: int64

## Pivot tables

In [58]:
df = pd.read_csv('https://drive.google.com/uc?export=download&id=1crtBicCaeBIbFsDP00MfUfun5QhqFiBl')
df.head()

,State,Account length,Area code,International plan,Voice mail plan,Number vmail messages,Total day minutes,Total day calls,Total day charge,Total eve minutes,Total eve calls,Total eve charge,Total night minutes,Total night calls,Total night charge,Total intl minutes,Total intl calls,Total intl charge,Customer service calls,Churn
0,KS,128,415,No,Yes,25,265.1,110,45.07,197.4,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False
1,OH,107,415,No,Yes,26,161.6,123,27.47,195.5,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False
2,NJ,137,415,No,No,0,243.4,114,41.38,121.2,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False
3,OH,84,408,Yes,No,0,299.4,71,50.90,61.9,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False
4,OK,75,415,Yes,No,0,166.7,113,28.34,148.3,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False

### crosstab()

Let's say we want to see how the observations in our sample are distributed in the context of two features - Churn and International plan. To do this, we can build a contingency table

In [59]:
pd.crosstab(df['Churn'], df['International plan'])

International plan    No  Yes
Churn
False               2664  186
True                 346  137

In [60]:
pd.crosstab(df['Churn'], df['Voice mail plan'], normalize=True)

Voice mail plan        No       Yes
Churn
False            0.602460  0.252625
True             0.120912  0.024002

### pivot_table()

**pivot_table** method takes as parameters:
- values  list of variables for which you want to calculate the necessary statistics
- index  list of variables by which you want to group data
- aggfunc  what we need to calculate by groups - the sum, average, maximum, etc.

In [61]:
df.pivot_table(['Total day calls', 'Total eve calls', 'Total night calls'], 
['Area code'], aggfunc='mean').head(10)

           Total day calls  Total eve calls  Total night calls
Area code
408             100.496420        99.788783          99.039379
415             100.576435       100.503927         100.398187
510             100.097619        99.671429         100.601190